project_overview.tex
% Created 2014-03-17 Mon 21:52
\documentclass[a4paper,6pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[margin=.75in]{geometry}
\usepackage[T1]{fontenc}
\usepackage[scaled=.7]{helvet}
\usepackage{courier} % tt
\linespread{1.01}
\author{N-CRITSER}
\date{\textit{<2014-03-17 Mon>}}
\title{project\_overview.org}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 23.4.1 (Org mode 8.2.4)}}
\begin{document}

\maketitle

\section{Abstract "Talk-a-lot-Bot"}
\label{sec-1}
  My goal is to create a talking entity using the Arduino Uno rev3, the AdaFruit
waveshield with SD card and a speaker for audio output.  I will be painting a 
piece of ABS plastic to take on human facial features. In addition the 
talk-a-lot-bot, will have 2 8x8 led matrix blocks with an I2C interface for 
simulated eye movement.  The mouth will be formed by cutting out the ABS plastic
and placing the speaker in the hole so voice sounds come from the direction of the 
mouth.  A user, will be given a small button pad, that allows some amount 
of interaction with the talk-a-lot-bot.  I have still not decided the extent of 
this interaction.     
\section{Components}
\label{sec-2}
\subsection{Adafruit waveshield sd card module}
\label{sec-2-1}
\subsection{Speaker}
\label{sec-2-2}
\subsection{Arduino Uno - 1 boards}
\label{sec-2-3}
\subsection{Battery pack lithium ion / ON-Off}
\label{sec-2-4}
\subsection{2-8x8 i2c led matrices for simulated eye movement}
\label{sec-2-5}
\subsection{adafruit libraries for graphics and sound}
\label{sec-2-6}
\subsection{ABS plastic sheets x 2}
\label{sec-2-7}
% Emacs 23.4.1 (Org mode 8.2.4)
\end{document}
